---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedShapeBuilderFallback.Mesh
enum: Autodesk.Revit.DB.TessellatedShapeBuilderFallback
source: html/ce755fa3-8727-2cd3-dbc3-c952bdc83a17.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderFallback.Mesh

If a requested geometrical object cannot be built using all data from the
 face set(s), create a mesh while using as much data from the face
 set(s) as possible.